app/Controllers/Admin/AsignaturaController.php

SELECT *
FROM `asignaturas`
ORDER BY `id` DESC
---
    public function index()
    {
        $asignaturas = $this->asignaturaModel->orderBy('id', 'desc')->findAll();

SELECT *
FROM `asignaturas`
WHERE `asignaturas`.`id` = '2'
SELECT *
FROM `atributos`
---
    public function agregarAtributos($id = null)
    {
        $asignatura = $this->asignaturaModel->find($id);
        $atributo = $this->atributoModel->findAll();

INSERT INTO `asignaturas` (`clave`, `nombre`, `creditos`, `horas_teoricas`, `horas_practicas`, `tipo_asignatura`, `descripcion`, `temario_asignatura`, `activo`, `horas_totales`, `created_at`, `updated_at`) VALUES ('IFE-1006', 'Administración para informática III', '5', NULL, NULL, 'Tronco común', '', NULL, 1, 0, '2024-01-03 00:27:51', '2024-01-03 00:27:51')
---
    public function guardarAtributos()
    {
        $atributosSeleccionados = $this->request->getVar('atributos');
        $asignaturaId = $this->request->getVar('asignatura_id');

        if ($atributosSeleccionados && $asignaturaId) {
            foreach ($atributosSeleccionados as $atributoId) {
                $data = [
                    'asignatura_id' => $asignaturaId,
                    'atributo_id' => $atributoId
                ];

                $this->asignaturaAtributoModel->insert($data);

SELECT *
FROM `asignaturas`
WHERE `asignaturas`.`id` = '2'
SELECT *
FROM `asignaturas_atributos`
JOIN `atributos` ON `atributos`.`id` = `asignaturas_atributos`.`atributo_id`
WHERE `asignaturas_atributos`.`asignatura_id` = '2'
---
    public function mostrarAtributos($id = null)
    {
        // Obtener los detalles de la asignatura
        $asignatura = $this->asignaturaModel->find($id);

        // Verificar si la asignatura existe
        if (!$asignatura) {
            // Si la asignatura no existe, redirigir o mostrar un mensaje de error
            return redirect()->to('/admin/asignaturas')->with('failed', 'Asignatura no encontrada.');
        }

        // Obtener los atributos asociados a la asignatura usando un join entre asignaturas_atributos y atributos
        $atributosAsignados = $this->asignaturaAtributoModel
            ->join('atributos', 'atributos.id = asignaturas_atributos.atributo_id') // Hacer el join con la tabla atributos
            ->where('asignaturas_atributos.asignatura_id', $id) // Filtrar por asignatura_id
            ->findAll(); // Obtener todos los registros correspondientes