app/Controllers/Admin/CarreraController.php

SELECT *
FROM `carreras`
---
    public function index()
    {
        $carreras = $this->carreraModel->findAll();

INSERT INTO `carreras` (`clave`, `nombre`, `created_at`, `updated_at`) VALUES ('C003', 'Carrer 03', '2023-12-16 18:29:27', '2023-12-16 18:29:27')
---
    public function create()
    {
        $data = [
            'clave' => $this->request->getPost('clave'),
            'nombre' => $this->request->getPost('nombre')
        ];

        $this->carreraModel->insert($data);

UPDATE `carreras` SET `clave` = 'C007', `nombre` = 'Carrera C007 --', `updated_at` = '2023-12-25 16:52:36'
WHERE `carreras`.`id` IN ('8')
---
    public function update($id)
    {
        $data = [
            // 'id'    => $id,
            'clave' => $this->request->getPost('clave'),
            'nombre' => $this->request->getPost('nombre')
        ];

        $this->carreraModel->update($id, $data);

DELETE FROM `carreras`
WHERE `id` IN ('5')
---
    public function delete($id = null)
    {
        $this->carreraModel->delete($id);