app/Controllers/Admin/CompetenciaController.php

    public function mostrarCalificaciones($id = null)
    {
        $atributo = $this->atributoModel->find($id);
---
SELECT *
FROM `atributos`
WHERE `atributos`.`id` = '1'