app/Controllers/Admin/UsuarioController.php

    public function index()
    {
        $usuarios = $this->usuario->findAll();


        $data = [
            'usuarios' => $usuarios,
            'perfiles'  => $this->perfil->findAll()
---
SELECT *
FROM `usuarios`
SELECT *
FROM `perfiles`

                    'fecha_nacimiento' => $fecha_nacimiento
                ]);

                return redirect()->to('/admin/usuarios')->with('success', 'Usuario registrada exitosamente.');
---
SELECT *
FROM `usuarios`

            /*
            else {

                $data = [
                    'usuarios'  => $this->usuario->findAll(),
                    'perfiles'  => $this->perfil->findAll(),
                    'validation' => isset($this->validator) ? $this->validator : null,
                    'oldData' => isset($oldData) ? $oldData : null,
                    'stayInCreateModal' => true,
                ];
---
SELECT *
FROM `perfiles`

            */
        }

        $data = [
            'usuarios'  => $this->usuario->findAll(),
            'perfiles'  => $this->perfil->findAll(),
            'validation' => isset($this->validator) ? $this->validator : null,
            'oldData' => isset($oldData) ? $oldData : null,
            'stayInCreateModal' => true,
        ];
---
SELECT *
FROM `usuarios`
SELECT *
FROM `perfiles`